# Задание 1.
# Строим единичный квадрат и вписываем в него круг.
# Разбрасываем случайно (равномерное распределение) N песчинок по квадрату, причем n песчинок падают на круг.
# Находим число пи по формуле n/N ~ (0.25pi)/1 -> pi ~ 4n/N, n получается аналитически,
# то есть расстояние от песчинки до центра окружности меньше 0.5.
# Сделать результат в форме таблицы приближения pi при N = 100, 1000, 10000
# и построить график зависимости pi от log10N

# Задание 2.
# Иванов встаёт и затрачивает (минут)
# 1) 10±2 зарядка
# 2) 15±3 умывание
# 3) 10±5 завтрак
# 4) 5±3 одевание
# 5) 3±2 время ожидание автобуса
# 6) 40±5 дорога
# 7) 5±3 пешком
# 8) 7±3 раздевалка
# Спрашивается, когда он должен встать, чтобы успеть на лекцию с вероятностью 95%
# на лекцию по МС на 3 пару, причем распределение случайных величин равномерно

# Задание 3.
# Построить генеральную совокупность значений...
#  Сгенерировать множество случайных чисел так, чтобы оно подчинялось распределению Симпсона...
# Разработать алгоритм генерирования случайных чисел, подчиняющихся распределению Симпсона
# Построить гистограмму распределения и сравнить её с распределением Симпсона (должны совпасть)
